---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BeamVJustification
source: html/72cfbdd1-8109-feef-3e57-2d19211fca2f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BeamVJustification Property

"z-Direction Justification"

## Syntax (C#)
```csharp
public static ForgeTypeId BeamVJustification { get; }
```